# 回到初始位姿

# go_home.py
# 让 UR5e 回到固定初始位姿（无夹爪控制）

# 在251229前采集数据使用的：
# -0.4896101190440506,
# -0.471618141865121,
# 0.42969127076079894,
# 1.1734031785209829,
# 2.848240223282975,
# 0.03257676565011889
# 但是关节6的角度临界，容易停机

# 251229：
#  [-0.4479512414011685, -0.47795323591463873, 0.3397913564298358, 1.135105428797068, 2.8938840645319757, -0.02678754322562883]
# 和之前的相似，但关节6绕回来一圈，来到限制中间，也就是0度左右
# 同时保证相机覆盖白纸
    
import socket
import time

def main():
    # host = "192.168.0.3"   # 控制箱 IP
    host = "192.168.0.4"   # 控制箱 IP
    port = 30001           # 与你原来的脚本保持一致

    #尽量的低，但手腕相机视野包括了整张白纸
    home_pose = [-0.4479512414011685, -0.47795323591463873, 0.3397913564298358, 1.135105428797068, 2.8938840645319757, -0.02678754322562883]

    cmd = (
        "movel(p[{x}, {y}, {z}, {rx}, {ry}, {rz}], a=1.2, v=0.2)\n"
        .format(x=home_pose[0], y=home_pose[1], z=home_pose[2],
                rx=home_pose[3], ry=home_pose[4], rz=home_pose[5])
    )

    s = socket.socket(socket.AF_INET, socket.SOCK_STREAM)
    s.settimeout(10)
    s.connect((host, port))

    time.sleep(0.5)        # 稍等网络稳定
    s.send(cmd.encode("utf-8"))
    time.sleep(5.0)        # 等待机械臂运动完成（按需要调整）

    s.close()

if __name__ == "__main__":
    main()
    





